doc: Convert diagrams to d2 and add more detail
