--- a/doc/visualizer-in-depth.md
+++ b/doc/visualizer-in-depth.md
@@ -1,68 +1,168 @@
+visualizer.
 
-[NEED TO ADD EVENTS/HANDLERS TO THIS DIAGRAM] [AND CONVERT TO D2]
+````d2 layout="elk"
+direction: down
+classes: {
+  dot: {
+    style.fill: blue
+    shape: circle
+    width: 10
+  }
+  method: {
+    height: 40
+    style: {
+      border-radius: 10
+      font-size: 20
+    }
+  }
+  returns: {
+    shape: cf-many
+    style.opacity: 0.0
+  }
+  deflt: {
+    style: {
+      stroke-width: 3
+      stroke-dash: 5
+    }
+  }
+  pseudolabel: {
+    shape: text
+    style: {
+      italic: true
+      font-size: 16
+    }
+  }
+}
 
-```mermaid
+early: {
+  direction: right
+  near: top-left
+  label: "can't use\n    sequence or sketch"
+  label.near: top-left
+  style.fill: "#fee"
+  style.font-size: 18
+  Start: "" {class: dot}
+  Init: |md
+    ### Create visualizer object
+    ```txt
+    property initializers,
+    constructor
+    ```
+  |
+  Start -> Init: "page load/\nvisualizer change" {style.font-size: 20}
+  SPC: |md
+    ### Parameter checks
+    ```txt
+         individual
+    validate() functions
+    ```
+  |
+  Init -> SPC
+}
+mid: {
+  near: center-left
+  label: "    sequence OK,\nno sketch"
+  label.near: top-left
+  style.fill: "#ffe"
+  style.font-size: 18
+  CheckPar: "checkParameters()" {class: method}
+  parUp: "parameter\nupdate" {class: pseudolabel}
+  inSeq: "initialization\nsequence change" {class: pseudolabel}
+  checkPar -- parUp
+  checkPar -- inseq
+  ParChg: "parametersChanged()" {class: method}
+  parUp -> ParChg
+  aligner: "" {
+    class: dot
+    width: 1
+  }
+  Reset: "reset()" {class: method}
+  inseq -- aligner -> Reset
+  ParChg -> Reset {class: deflt}
+  PreSk: "presketch()" {class: method}
+  Reset -> PreSk: "initialization\ncanvas resize\nsequence change"
+}
+early.SPC -> mid.CheckPar
+late: {
+  near: center-right
+  direction: up
+  label: "sequence & sketch OK"
+  label.near: top-right
+  style.fill: "#efe"
+  style.font-size: 18
+  Setup: "setup()" {class: method}
+  Draw: "draw()" {
+    class: method
+    height: 50
+    style.font-size: 24
+  }
+  Setup -> Draw
+  Draw -> Draw {target-arrowhead: "[stop()/\ncontinue()]    "}
+  Resize: "resized()" {class: method}
+  Draw -> Resize: "resize\nwindow"
+  Resize <-> Draw {
+    source-arrowhead: "(returns\nfalse)" {shape: cf-many}
+  }
+  routing1: "" {
+    class: dot
+    width: 2
+  }
+  routing2: "" {
+    class: dot
+    width: 2
+  }
+  Resize <- routing1: {
+    class: deflt
+    source-arrowhead: "(returns\ntrue)" {shape: cf-many}
+  }
+  routing1 -- routing2 {class: deflt}
+  Event: "" {class: dot}
+  Handler: "(handler method)" {class: method}
+  Event -> Handler: "mouse click/\nkey press/\netc."
+}
+mid.Reset -> late.Setup: "otherwise" {style.font-size: 20}
+mid.PreSK -> late.Setup
+late.Draw -> early.SPC: "parameter\nchange"
+late.Draw -> mid.CheckPar: "change\nsequence"
+late.routing2 -> mid.Reset: {class: deflt}
 
-flowchart TB
-   Start@{shape: circ, label: " "}
-   style Start fill:none,stroke:none
-   subgraph NSQNSK [neither sequence nor sketch OK]
-   Init@{shape: bow-rect, label: "property<br>initializers/<br>constructor"}
-   Start -->|page load/<br>visualizer change| Init
-   IPV@{shape: bow-rect, label: "individual parameter<br>validate() functions"}
-   Init --> IPV
-   end
-   style NSQNSK fill:#fee,text-align:left
-   subgraph SQBNSK [sequence OK, no sketch]
-   CP@{shape: rounded, label: "checkParameters()"}
-   IPV --> CP
-   Reset@{shape: rounded, label: "reset()"}
-   CP -->|initialization/<br>sequence change| Reset
-   PC@{shape: rounded, label: "parametersChanged()"}
-   CP -->|parameter update| PC
-   PC ==> Reset
-   PS@{shape: rounded, label: "presketch()"}
-   end
-   subgraph SQSK [sequence & sketch OK]
-   RS@{shape: rounded, label: "resized()"}
-   Setup@{shape: rounded, label: "setup()"}
-   Reset -->|initialization<br>canvas resize<br>sequence change| PS
-   Reset -->|otherwise| Setup
-   PS --> Setup
-   Draw@{shape: rounded, label: "draw()"}
-   Setup --> Draw
-   RS ==>|"↑<br>(returns true)<br>↑"| Reset
-   RS -->|"↗(returns false)↗"| Draw
-   Draw -->|"↑<br>change sequence<br>↑"| CP
-   Draw -->|"↑<br>change parameter<br>↑"| IPV
-   Draw -->|"[stop()/continue()]"| Draw
-   Draw -->|resize window| RS
-   end
-   style SQSK fill:#efe
+spacer: " " {
+  near: bottom-center
+  width: 120
+  style.opacity: 0.0
+}
+key: {
+  near: bottom-left
+  label.near: top-left
+  direction: right
+  method: "classMethod()" {
+    class: method
+    style.opacity: 0.6
+  }
+  otherCode: |
+    ### Other code section
+    ```txt
+    details
+    ...
+    ```
+  | {style.opacity: 0.6}
+  method -> otherCode: "action/event" {style.font-size: 18}
+  method -> otherCode: "default behavior\ncan override" {class: deflt}
+  style.opacity: 0.4
+}
+````
 
-```
-
-A few notes on the diagram: Each lavender rounded rectangle represents a
-method of the visualizer class that you may override or extend. The rectangles
